.emacs.d/config.org
#+TITLE: Gnu Emacs Config
#+AUTHOR: Dmitrii Borisov
#+DESCRIPTION: Personal Emacs conifg.
#+STARTUP: showeveryting
#+OPTIONS: toc:2

* IMPORTANT PROGRAMS TO LOAD FIRST

** MELPA Package manager
*** Melpa package manager
#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
;; and `package-pinned-packages`. Most users will not need or want to do this.
;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)
#+end_src

*** Use package
#+begin_src emacs-lisp
(eval-when-compile (require 'use-package))
#+end_src

** Appearance defaults
*** Desable minibars, scrollbars etc.
#+begin_src emacs-lisp
(setq inhibit-startup-screen t)

(scroll-bar-mode 0)
(menu-bar-mode 0)
(tool-bar-mode 0)
(column-number-mode 1)
(show-paren-mode 1)

(global-display-line-numbers-mode)
(setq display-line-numbers 'relative)

(setq make-backup-files nil)

(global-auto-revert-mode t)
#+end_src

*** Font height and scale
#+begin_src emacs-lisp
(set-face-attribute 'default nil :height 140)
(set-face-attribute 'default nil :font "Fira Code" :height 140)
#+end_src

** Keybindings
*** Newlines insertion
#+begin_src emacs-lisp
;; Insert new line below current line
(global-set-key (kbd "<C-return>") (lambda ()
                   (interactive)
                   (end-of-line)
                   (newline-and-indent)))
;; Insert new line above current line

(global-set-key (kbd "<C-S-return>") (lambda ()
                       (interactive)
                       (previous-line)
                       (end-of-line)
                       (newline-and-indent)))

#+end_src

** Important misc
*** Ido mode
#+begin_src emacs-lisp
(ido-mode t)
#+end_src

*** Ivy
#+begin_src emacs-lisp
(require 'ivy)
(ivy-mode)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
#+end_src

** Git
*** Magit
#+begin_src emacs-lisp
(require 'magit)
#+end_src

*** Git gutter
#+begin_src emacs-lisp
(require 'git-gutter)(
global-git-gutter-mode t)
#+end_src

*** Git gutter fringe
#+begin_src emacs-lisp
(require 'git-gutter-fringe)
(define-fringe-bitmap 'git-gutter-fr:added [#b11100000] nil nil '(center repeated))
(define-fringe-bitmap 'git-gutter-fr:modified [#b11100000] nil nil '(center repeated))
(define-fringe-bitmap 'git-gutter-fr:deleted
  [#b10000000
   #b11000000
   #b11100000
   #b11110000] nil nil 'bottom)
#+end_src

** Evil Mode
#+begin_src emacs-lisp
(require 'evil)
(evil-mode -1)
#+end_src

** Modes
*** Typescript mode
#+begin_src emacs-lisp
(use-package typescript-mode
	:config
	(add-hook 'typescript-mode-hook (lambda () (typescript-mode 1)))
)
#+end_src

*** Web mode
#+begin_src emacs-lisp
(use-package web-mode)
(add-to-list 'auto-mode-alist '("\\.jsx\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
#+end_src

*** Rust mode
#+begin_src emacs-lisp
(use-package rust-mode)
#+end_src

*** Dockerfile mode
#+begin_src emacs-lisp
(use-package dockerfile-mode)
#+end_src

*** Org mode bullets
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets
	:config
	(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

*** Markdown mode
#+begin_src emacs-lisp
(use-package markdown-mode
	:config
	(add-hook 'markdown-mode-hook (lambda () (markdown-mode 1))))
#+end_src

** Utility packages
*** Flycheck
#+begin_src emacs-lisp
(require 'flycheck)
(global-flycheck-mode)
(with-eval-after-load 'flycheck
  (add-hook 'flycheck-mode-hook #'flycheck-inline-mode))
#+end_src

*** Flycheck rust
#+begin_src emacs-lisp
(require 'flycheck-rust)
(with-eval-after-load 'rust-mode
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))
#+end_src

*** Eglot
#+begin_src emacs-lisp
(require 'eglot)
(add-hook 'rust-mode-hook 'eglot-ensure)
#+end_src

*** Yasnippet
#+begin_src emacs-lisp
(require 'yasnippet)
(setq yas-triggers-in-field nil)
#+end_src

*** Company
#+begin_src emacs-lisp
(require 'company)
(global-company-mode)
#+end_src

** Tide
#+begin_src emacs-lisp
(use-package tide
	:init 
	(defun setup-tide-mode ()
  	(interactive)
  	(tide-setup)
  	(flycheck-mode +1)
  	(setq flycheck-check-syntax-automatically '(save mode-enabled))
  	(eldoc-mode +1)
  	(tide-hl-identifier-mode +1)
	;; company is an optional dependency. You have to
  	;; install it separately via package-install
  	;; `M-x package-install [ret] company`
  	(company-mode +1))
	:config
	;; aligns annotation to the right hand side
	(setq company-tooltip-align-annotations t)
	;; if you use typescript-mode
	(add-hook 'typescript-mode-hook #'setup-tide-mode)
)
;; formats the buffer before saving
;; (add-hook 'before-save-hook 'tide-format-before-save)

#+end_src

